#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_string.random: Refreshing state... [id=0r6pob]
aws_acm_certificate.retrieval_covidshield: Refreshing state... [id=arn:aws:acm:us-east-1:005133826942:certificate/af342fd8-8ae9-4dcb-99f1-d9b9460f9c0f]
aws_wafv2_web_acl.key_retrieval_cdn: Refreshing state... [id=c70e4ca5-1d56-4909-9611-b994a42d22fa]
aws_wafv2_ip_set.new_key_claim: Refreshing state... [id=4c12748b-a97a-4e9d-ae37-4fac954418bf]
aws_route53_zone.covidshield: Refreshing state... [id=Z04433932EK0CRE7JPWYS]
aws_route53_health_check.covidshield_key_submission_healthcheck: Refreshing state... [id=590ba1b2-e8bd-43a9-bfda-3f35ed44484c]
aws_secretsmanager_secret.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ]
aws_secretsmanager_secret.server_database_url: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq]
aws_iam_role.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs]
aws_ecr_repository.repository["monolith"]: Refreshing state... [id=covid-server/monolith]
aws_ecr_repository.repository["key-retrieval"]: Refreshing state... [id=covid-server/key-retrieval]
aws_ecr_repository.repository["key-submission"]: Refreshing state... [id=covid-server/key-submission]
aws_vpc.covidshield: Refreshing state... [id=vpc-06fbc7337b116cce1]
aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E2UM372AG7L2ZR]
aws_secretsmanager_secret.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ]
aws_iam_role.firehose_waf_logs: Refreshing state... [id=firehose_waf_logs]
aws_secretsmanager_secret.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd]
aws_iam_role.lambda_validate_deploy: Refreshing state... [id=lambda-validate-deploy]
aws_secretsmanager_secret.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt]
aws_ecs_cluster.covidshield: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:cluster/CovidShield]
aws_wafv2_web_acl.key_retrieval: Refreshing state... [id=691f016d-bf45-4ae9-979a-a9df848ea422]
aws_acm_certificate.covidshield: Refreshing state... [id=arn:aws:acm:ca-central-1:005133826942:certificate/2458141b-63d1-4d37-bb2c-3e0f68e38cfd]
aws_route53_health_check.covidshield_key_retrieval_healthcheck_ca_json: Refreshing state... [id=f04e8175-09f3-4965-b93b-fba7405154cb]
aws_route53_health_check.covidshield_key_retrieval_healthcheck_region_json: Refreshing state... [id=a331d481-399b-4bfd-9546-a49c67f2c0c2]
aws_route53_health_check.covidshield_key_retrieval_healthcheck: Refreshing state... [id=4866eebf-9567-41bf-984c-e6616d3b245e]
aws_iam_role.covidshield_key_submission: Refreshing state... [id=KeySubmission]
aws_iam_role.covidshield_key_retrieval: Refreshing state... [id=KeyRetrieval]
aws_iam_role_policy.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs:vpc_flow_logs]
aws_iam_role.codedeploy: Refreshing state... [id=codedeploy]
aws_ecr_lifecycle_policy.policy["key-retrieval"]: Refreshing state... [id=covid-server/key-retrieval]
aws_secretsmanager_secret_version.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ|2B43B497-FCB3-4CEA-B5F6-4FFF96AE6963]
aws_ecr_lifecycle_policy.policy["key-submission"]: Refreshing state... [id=covid-server/key-submission]
aws_iam_role_policy.lambda_validate_codedeploy: Refreshing state... [id=lambda-validate-deploy:LambdaValidateCodeDeploy]
aws_ecr_lifecycle_policy.policy["monolith"]: Refreshing state... [id=covid-server/monolith]
aws_route53_record.retrieval_covidshield_certificate_validation["retrieval.wild-samphire.cdssandbox.xyz"]: Refreshing state... [id=Z04433932EK0CRE7JPWYS__b13a4895c584eec12f4f7dcc773be991.retrieval.wild-samphire.cdssandbox.xyz._CNAME]
aws_secretsmanager_secret_version.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ|D2FCCE5B-E06B-46D2-BF3F-D96376BE5D64]
aws_secretsmanager_secret_version.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd|942EFC36-1A49-4160-8E17-3150DFD46E8F]
aws_s3_bucket.exposure_config: Refreshing state... [id=covid-shield-exposure-config-staging]
aws_s3_bucket.cloudfront_logs: Refreshing state... [id=covid-shield-staging-cloudfront-logs]
aws_kms_key.cw_us_east: Refreshing state... [id=79838c16-349c-47bc-a142-ad819e31bec1]
aws_kms_key.cw: Refreshing state... [id=f190bddc-b122-446d-aaa3-f013f6ba43ad]
aws_iam_role_policy_attachment.lambda_validate_deploy: Refreshing state... [id=lambda-validate-deploy-20200727193113071300000001]
aws_shield_protection.route53_covidshield[0]: Refreshing state... [id=64bc3981-ab8f-45bc-ab63-085a5713d37d]
aws_s3_bucket.firehose_waf_logs: Refreshing state... [id=covid-shield-staging-waf-logs]
aws_secretsmanager_secret_version.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt|2071D0FB-069E-4028-96EC-2A27AEA3B5BA]
aws_iam_role_policy_attachment.ecs_task_execution_key_submission: Refreshing state... [id=KeySubmission-20200602222525692500000004]
aws_iam_role_policy_attachment.ecs_task_execution_key_retrieval: Refreshing state... [id=KeyRetrieval-20200602222525384200000003]
aws_wafv2_web_acl.key_submission: Refreshing state... [id=a4a38f51-4df7-4869-b85d-c5efcad21975]
aws_iam_role_policy_attachment.codedeploy: Refreshing state... [id=codedeploy-20200710192933426100000001]
aws_iam_policy.covidshield_secrets_manager_key_submission: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidShieldSecretsManagerKeySubmission]
aws_route53_record.covidshield_certificate_validation["*.wild-samphire.cdssandbox.xyz"]: Refreshing state... [id=Z04433932EK0CRE7JPWYS__0c39db230baa61f4d0ac135fb798441a.wild-samphire.cdssandbox.xyz._CNAME]
aws_route53_record.covidshield_certificate_validation["wild-samphire.cdssandbox.xyz"]: Refreshing state... [id=Z04433932EK0CRE7JPWYS__0c39db230baa61f4d0ac135fb798441a.wild-samphire.cdssandbox.xyz._CNAME]
aws_iam_policy.covidshield_secrets_manager_key_retrieval: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidShieldSecretsManagerKeyRetrieval]
aws_sns_topic.alert_critical_us_east: Refreshing state... [id=arn:aws:sns:us-east-1:005133826942:alert-critical]
aws_sns_topic.alert_warning_us_east: Refreshing state... [id=arn:aws:sns:us-east-1:005133826942:alert-warning]
aws_acm_certificate_validation.retrieval_covidshield: Refreshing state... [id=2020-06-02 22:27:57 +0000 UTC]
aws_iam_role_policy_attachment.secrets_manager_key_submission: Refreshing state... [id=KeySubmission-20200602222528088400000006]
aws_iam_role_policy_attachment.secrets_manager_key_retrieval: Refreshing state... [id=KeyRetrieval-20200602222527744300000005]
aws_security_group.privatelink: Refreshing state... [id=sg-0e0070c8141ce36a5]
aws_lb_target_group.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:targetgroup/covidshield-key-submission/8bdfb6dab38f61bc]
aws_default_network_acl.covidshield: Refreshing state... [id=acl-05e6c26d51f1808a6]
aws_internet_gateway.covidshield: Refreshing state... [id=igw-087e301b2766b65d1]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-03d928d3aab2d6a2d]
aws_lb_target_group.covidshield_key_retrieval_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:targetgroup/covidshield-key-retrieval-2/8338d86d80abb99e]
aws_lb_target_group.covidshield_key_submission_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:targetgroup/covidshield-key-submission-2/4ce0a8eb89ba3700]
aws_subnet.covidshield_public[0]: Refreshing state... [id=subnet-0b6825247e5637145]
aws_subnet.covidshield_public[1]: Refreshing state... [id=subnet-00801f4347017b594]
aws_subnet.covidshield_public[2]: Refreshing state... [id=subnet-02247d31a6dae842c]
aws_security_group.covidshield_key_retrieval: Refreshing state... [id=sg-0dccc93503d5844ed]
aws_security_group.covidshield_key_submission: Refreshing state... [id=sg-01c8d2505904ab6c7]
aws_subnet.covidshield_private[0]: Refreshing state... [id=subnet-034f98e3cdd11a7ef]
aws_subnet.covidshield_private[1]: Refreshing state... [id=subnet-083e2bb4d6a9edf1d]
aws_subnet.covidshield_private[2]: Refreshing state... [id=subnet-05ffd2f0b629a7731]
aws_lb_target_group.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:targetgroup/covidshield-key-retrieval/c7b5925456e52396]
aws_cloudwatch_metric_alarm.route53_submission_health_check: Refreshing state... [id=Route53SubmissionHealthCheck]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check_region_json: Refreshing state... [id=Route53RetrievalHealthCheckRegionJson]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check_ca_json: Refreshing state... [id=Route53RetrievalHealthCheckCAJson]
aws_cloudwatch_metric_alarm.ddos_detected_route53: Refreshing state... [id=DDoSDetectedRoute53]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check: Refreshing state... [id=Route53RetrievalHealthCheck]
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs]
aws_sns_topic.alert_critical: Refreshing state... [id=arn:aws:sns:ca-central-1:005133826942:alert-critical]
aws_cloudwatch_log_group.covidshield: Refreshing state... [id=CovidShield]
aws_sns_topic.alert_warning: Refreshing state... [id=arn:aws:sns:ca-central-1:005133826942:alert-warning]
aws_acm_certificate_validation.covidshield: Refreshing state... [id=2020-06-02 22:27:15 +0000 UTC]
aws_route_table.covidshield_public_subnet: Refreshing state... [id=rtb-03861af82fb085c83]
aws_security_group_rule.privatelink_retrieval_ingress: Refreshing state... [id=sgrule-2545732239]
aws_security_group_rule.covidshield_key_retrieval_egress_s3_privatelink: Refreshing state... [id=sgrule-2719532639]
aws_security_group_rule.covidshield_key_retrieval_egress_privatelink: Refreshing state... [id=sgrule-75996846]
aws_security_group.covidshield_redis[0]: Refreshing state... [id=sg-00428626a8255eeb8]
aws_security_group_rule.covidshield_key_submission_egress_s3_privatelink: Refreshing state... [id=sgrule-437173826]
aws_security_group.covidshield_database: Refreshing state... [id=sg-06be84cecd0622042]
aws_security_group_rule.privatelink_submission_ingress: Refreshing state... [id=sgrule-1094651719]
aws_security_group_rule.covidshield_key_submission_egress_privatelink: Refreshing state... [id=sgrule-887278672]
aws_vpc_endpoint.kms: Refreshing state... [id=vpce-0e382c0d4499a5cfd]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-00624d24717c416b9]
aws_vpc_endpoint.monitoring: Refreshing state... [id=vpce-0a75ab51de2941758]
aws_db_subnet_group.covidshield: Refreshing state... [id=server]
aws_elasticache_subnet_group.covidshield[0]: Refreshing state... [id=covidshield]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-04c456686a79e9277]
aws_security_group.covidshield_load_balancer: Refreshing state... [id=sg-0296a1b94945261b0]
aws_s3_bucket_public_access_block.cloudfront_logs: Refreshing state... [id=covid-shield-staging-cloudfront-logs]
aws_s3_bucket_policy.exposure_config: Refreshing state... [id=covid-shield-exposure-config-staging]
aws_route_table_association.covidshield[0]: Refreshing state... [id=rtbassoc-06840ee480651c555]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[4]: Refreshing state... [id=DiagnosisKeyTotal4]
aws_route_table_association.covidshield[1]: Refreshing state... [id=rtbassoc-0125db6a42d62bdc4]
aws_route_table_association.covidshield[2]: Refreshing state... [id=rtbassoc-0e354c2cca8e3649a]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[7]: Refreshing state... [id=DiagnosisKeyTotal7]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[5]: Refreshing state... [id=DiagnosisKeyTotal5]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[1]: Refreshing state... [id=DiagnosisKeyTotal1]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[2]: Refreshing state... [id=DiagnosisKeyTotal2]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[0]: Refreshing state... [id=DiagnosisKeyTotal0]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[6]: Refreshing state... [id=DiagnosisKeyTotal6]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[3]: Refreshing state... [id=DiagnosisKeyTotal3]
aws_cloudwatch_log_metric_filter.fatal_logged: Refreshing state... [id=FatalLogged]
aws_cloudwatch_log_metric_filter.error_logged: Refreshing state... [id=ErrorLogged]
aws_cloudwatch_log_metric_filter.unauthorized_new_one_time_code_requests: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequests]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[1]: Refreshing state... [id=UnclaimedOneTimeCodeTotal1]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[2]: Refreshing state... [id=UnclaimedOneTimeCodeTotal2]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[7]: Refreshing state... [id=UnclaimedOneTimeCodeTotal7]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[3]: Refreshing state... [id=UnclaimedOneTimeCodeTotal3]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[4]: Refreshing state... [id=UnclaimedOneTimeCodeTotal4]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[5]: Refreshing state... [id=UnclaimedOneTimeCodeTotal5]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[6]: Refreshing state... [id=UnclaimedOneTimeCodeTotal6]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[0]: Refreshing state... [id=UnclaimedOneTimeCodeTotal0]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[5]: Refreshing state... [id=ClaimedOneTimeCodeTotal5]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[6]: Refreshing state... [id=ClaimedOneTimeCodeTotal6]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[4]: Refreshing state... [id=ClaimedOneTimeCodeTotal4]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[0]: Refreshing state... [id=ClaimedOneTimeCodeTotal0]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[1]: Refreshing state... [id=ClaimedOneTimeCodeTotal1]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[2]: Refreshing state... [id=ClaimedOneTimeCodeTotal2]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[7]: Refreshing state... [id=ClaimedOneTimeCodeTotal7]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[3]: Refreshing state... [id=ClaimedOneTimeCodeTotal3]
aws_cloudwatch_log_metric_filter.unauthorized_one_time_code_claim_requests: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequests]
aws_cloudwatch_log_metric_filter.unauthorized_upload_requests: Refreshing state... [id=UnauthorizedUploadRequests]
aws_cloudwatch_log_metric_filter.five_hundred_response: Refreshing state... [id=500Response]
aws_cloudwatch_log_metric_filter.key_clear_called: Refreshing state... [id=KeyClearCalled]
aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0a670007e64c4caa5]
aws_cloudwatch_metric_alarm.UnclaimedOneTimeCodeTotalWarn: Refreshing state... [id=UnclaimedOneTimeCodeTotalWarn]
aws_cloudwatch_metric_alarm.DiagnosisKeyTotalWarn: Refreshing state... [id=DiagnosisKeyTotalWarn]
aws_cloudwatch_metric_alarm.ClaimedOneTimeCodeTotalWarn: Refreshing state... [id=ClaimedOneTimeCodeTotalWarn]
aws_cloudwatch_metric_alarm.UnclaimedOneTimeCodeTotalCritical: Refreshing state... [id=UnclaimedOneTimeCodeTotalCritical]
aws_cloudwatch_metric_alarm.DiagnosisKeyTotalCritical: Refreshing state... [id=DiagnosisKeyTotalCritical]
aws_cloudwatch_metric_alarm.ClaimedOneTimeCodeTotalCritical: Refreshing state... [id=ClaimedOneTimeCodeTotalCritical]
aws_s3_bucket_public_access_block.firehose_waf_logs: Refreshing state... [id=covid-shield-staging-waf-logs]
aws_iam_role_policy.firehose_waf_logs: Refreshing state... [id=firehose_waf_logs:firehose-waf-logs-policy]
aws_kinesis_firehose_delivery_stream.firehose_waf_logs: Refreshing state... [id=arn:aws:firehose:ca-central-1:005133826942:deliverystream/aws-waf-logs-covid-shield]
aws_kinesis_firehose_delivery_stream.firehose_waf_logs_us_east: Refreshing state... [id=arn:aws:firehose:us-east-1:005133826942:deliverystream/aws-waf-logs-covid-shield-us-east]
aws_security_group_rule.covidshield_key_retrieval_egress_redis[0]: Refreshing state... [id=sgrule-1550434783]
aws_security_group_rule.covidshield_key_submission_egress_redis[0]: Refreshing state... [id=sgrule-1395854673]
aws_security_group_rule.covidshield_key_retrieval_egress_database: Refreshing state... [id=sgrule-3724577019]
aws_security_group_rule.covidshield_key_submission_egress_database: Refreshing state... [id=sgrule-3512353909]
aws_vpc_endpoint.ecr-dkr: Refreshing state... [id=vpce-06f9d455bfc92cb6d]
aws_vpc_endpoint.ecr-api: Refreshing state... [id=vpce-00fcf8f057a8aed2d]
aws_elasticache_replication_group.covidshield[0]: Refreshing state... [id=covidshield]
aws_security_group_rule.covidshield_key_retrieval_ingress_alb: Refreshing state... [id=sgrule-2893084300]
aws_rds_cluster.covidshield_server: Refreshing state... [id=server-cluster]
aws_lb.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-submission/00743585bbc9c7b9]
aws_security_group_rule.covidshield_key_submission_ingress_alb: Refreshing state... [id=sgrule-3675801171]
aws_lb.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-retrieval/50d87157735ad56c]
aws_cloudwatch_metric_alarm.unauthorized_new_one_time_code_requests_critical: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequestsCritical]
aws_cloudwatch_metric_alarm.error_logged_warn: Refreshing state... [id=ErrorLoggedWarn]
aws_cloudwatch_metric_alarm.unauthorized_new_one_time_code_requests_warn: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequestsWarn]
aws_cloudwatch_metric_alarm.error_logged_critical: Refreshing state... [id=ErrorLoggedCritical]
aws_cloudwatch_metric_alarm.fatal_logged_warn: Refreshing state... [id=FatalLoggedWarn]
aws_cloudwatch_metric_alarm.unauthorized_one_time_code_claim_requests_warn: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequestsWarn]
aws_cloudwatch_metric_alarm.unauthorized_one_time_code_claim_requests_critical: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequestsCritical]
aws_cloudwatch_metric_alarm.unauthorized_upload_requests_critical: Refreshing state... [id=UnauthorizedUploadRequestsCritical]
aws_cloudwatch_metric_alarm.unauthorized_upload_requests_warn: Refreshing state... [id=UnauthorizedUploadRequestsWarn]
aws_cloudwatch_metric_alarm.five_hundred_response_warn: Refreshing state... [id=500ResponseWarn]
aws_cloudwatch_metric_alarm.five_hundred_response_critical: Refreshing state... [id=500ResponseCritical]
aws_cloudwatch_metric_alarm.key_clear_called_warn: Refreshing state... [id=KeyClearCalledWarn]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval_cdn: Refreshing state... [id=arn:aws:wafv2:us-east-1:005133826942:global/webacl/key_retrieval_cdn/c70e4ca5-1d56-4909-9611-b994a42d22fa]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval: Refreshing state... [id=arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_retrieval/691f016d-bf45-4ae9-979a-a9df848ea422]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs: Refreshing state... [id=arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_submission/a4a38f51-4df7-4869-b85d-c5efcad21975]
aws_route53_record.covidshield_key_submission: Refreshing state... [id=Z04433932EK0CRE7JPWYS_submission.wild-samphire.cdssandbox.xyz._A]
aws_wafv2_web_acl_association.key_submission_assocation: Refreshing state... [id=arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_submission/a4a38f51-4df7-4869-b85d-c5efcad21975,arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-submission/00743585bbc9c7b9]
aws_shield_protection.alb_covidshield_key_submission[0]: Refreshing state... [id=ac6d6d4d-7e27-4c21-9cda-3db2003214eb]
aws_lambda_function.submission_lambda_validate_deploy: Refreshing state... [id=SubmissionValidateBeforeTraffic]
aws_cloudwatch_metric_alarm.ddos_detected_submission: Refreshing state... [id=DDoSDetectedSubmissionALB]
aws_lb_listener.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:listener/app/covidshield-key-submission/00743585bbc9c7b9/92b1ea8b2c9510e1]
aws_lambda_function.retrieval_lambda_validate_deploy: Refreshing state... [id=RetrievalValidateBeforeTraffic]
aws_lb_listener.covidshield_key_retrieval_test: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:listener/app/covidshield-key-retrieval/50d87157735ad56c/5194911373d259ac]
aws_lb_listener.covidshield_key_submission_test: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:listener/app/covidshield-key-submission/00743585bbc9c7b9/a5900994e491bbdc]
aws_lb_listener.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:listener/app/covidshield-key-retrieval/50d87157735ad56c/fc199d80f40d661c]
aws_cloudfront_distribution.key_retrieval_distribution: Refreshing state... [id=E32JQ26FGBXFB9]
aws_wafv2_web_acl_association.key_retrieval_assocation: Refreshing state... [id=arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_retrieval/691f016d-bf45-4ae9-979a-a9df848ea422,arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-retrieval/50d87157735ad56c]
aws_cloudwatch_metric_alarm.ddos_detected_retrieval: Refreshing state... [id=DDoSDetectedRetrievalALB]
aws_shield_protection.alb_covidshield_key_retrieval[0]: Refreshing state... [id=52be9ccf-d751-4dbd-835a-10da0c348077]
aws_secretsmanager_secret_version.server_database_url: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq|8A107EAD-40A2-492D-A143-F415F5749664]
aws_rds_cluster_instance.covidshield_server_instances[2]: Refreshing state... [id=server-instance-2]
aws_rds_cluster_instance.covidshield_server_instances[0]: Refreshing state... [id=server-instance-0]
aws_rds_cluster_instance.covidshield_server_instances[1]: Refreshing state... [id=server-instance-1]
aws_cloudwatch_metric_alarm.ddos_detected_cdn: Refreshing state... [id=DDoSDetectedCDN]
aws_route53_record.covidshield_key_retrieval: Refreshing state... [id=Z04433932EK0CRE7JPWYS_retrieval.wild-samphire.cdssandbox.xyz._A]
aws_shield_protection.key_retrieval_distribution[0]: Refreshing state... [id=0d13b65f-f8bd-4b05-a2de-770f954d639b]
aws_ecs_task_definition.covidshield_key_submission: Refreshing state... [id=KeySubmission]
aws_ecs_task_definition.covidshield_key_retrieval: Refreshing state... [id=KeyRetrieval]
aws_ecs_service.covidshield_key_submission: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:service/CovidShield/KeySubmission]
aws_ecs_service.covidshield_key_retrieval: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:service/CovidShield/KeyRetrieval]
module.covid-shield-submission.aws_codedeploy_app.app: Refreshing state... [id=cab4ad0b-ba11-4cca-82a5-923b35b089f1:AppECS-CovidShield-KeySubmission]
aws_cloudwatch_metric_alarm.submission_cpu_utilization_high: Refreshing state... [id=submission-cpu-utilization-high]
aws_cloudwatch_metric_alarm.submission_memory_utilization_high: Refreshing state... [id=submission-memory-utilization-high]
aws_cloudwatch_metric_alarm.retrieval_memory_utilization_high: Refreshing state... [id=retrieval-memory-utilization-high]
module.covid-shield-retrieval.aws_codedeploy_app.app: Refreshing state... [id=51f07c9a-b972-4865-b6ca-a9e8bdaeda2a:AppECS-CovidShield-KeyRetrieval]
aws_cloudwatch_metric_alarm.retrieval_cpu_utilization_high: Refreshing state... [id=retrieval-cpu-utilization-high]
module.covid-shield-submission.aws_codedeploy_deployment_group.app: Refreshing state... [id=2b72c17e-0829-4ed0-903f-7d35de18ff2f]
module.covid-shield-retrieval.aws_codedeploy_deployment_group.app: Refreshing state... [id=6e321c06-ff3a-42be-9fe6-1b92b8167cc3]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.covidshield_key_retrieval_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_retrieval_task"  {
      ~ id       = "6ccaecc5026b1e887600b4d6d857e64b470639e374494fb21a11ecef23a7b341" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "z8oP0NRnbJ8P1frPGQrd"
                        },
                    ]
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.template_file.covidshield_key_submission_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_submission_task"  {
      ~ id       = "7e5c7c8ced1906b3a2a03de7091a2d6f295497ab50441e8d87e8dfc46afe4f6c" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "ENABLE_TEST_TOOLS"
                          - value = "true"
                        },
                    ]
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-submission"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeySubmission"
                        }
                    }
                  - name             = "key-submission"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_account.demo will be created
  + resource "aws_api_gateway_account" "demo" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # aws_api_gateway_api_key.metrics_api_key will be created
  + resource "aws_api_gateway_api_key" "metrics_api_key" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "Dev-Key"
      + value             = (sensitive value)
    }

  # aws_api_gateway_deployment.metrics will be created
  + resource "aws_api_gateway_deployment" "metrics" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
    }

  # aws_api_gateway_integration.metrics will be created
  + resource "aws_api_gateway_integration" "metrics" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration_response.metrics_response will be created
  + resource "aws_api_gateway_integration_response" "metrics_response" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # aws_api_gateway_method.create_method will be created
  + resource "aws_api_gateway_method" "create_method" {
      + api_key_required = true
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method_response.response_200 will be created
  + resource "aws_api_gateway_method_response" "response_200" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # aws_api_gateway_method_settings.method_settings will be created
  + resource "aws_api_gateway_method_settings" "method_settings" {
      + id          = (known after apply)
      + method_path = "cds-covid-alert-create-metric-record/POST"
      + rest_api_id = (known after apply)
      + stage_name  = "staging"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 5000
          + throttling_rate_limit                      = 10000
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_api_gateway_resource.create_resource will be created
  + resource "aws_api_gateway_resource" "create_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "cds-covid-alert-create-metric-record"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.metrics will be created
  + resource "aws_api_gateway_rest_api" "metrics" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + description              = "Terraform Serverless api for COVID Alert metrics collection"
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "cds-covid-alert-create-metric-record"
      + policy                   = (known after apply)
      + root_resource_id         = (known after apply)
      + tags                     = {
          + "CostCentre"  = "CovidShield"
          + "Deployment"  = "Terraform"
          + "Environment" = "staging"
          + "Name"        = "cds-covid-alert-create-metric-record"
          + "Project"     = "COVID-Alert"
          + "Resource"    = "API-Gateway"
        }

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # aws_api_gateway_stage.metrics will be created
  + resource "aws_api_gateway_stage" "metrics" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "staging"
      + xray_tracing_enabled = true
    }

  # aws_api_gateway_usage_plan.metrics_usage_plan will be created
  + resource "aws_api_gateway_usage_plan" "metrics_usage_plan" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "Dev-Key_usage_plan"

      + api_stages {
          + api_id = (known after apply)
          + stage  = "staging"
        }
    }

  # aws_api_gateway_usage_plan_key.main will be created
  + resource "aws_api_gateway_usage_plan_key" "main" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # aws_cloudwatch_log_group.api_log_group will be created
  + resource "aws_cloudwatch_log_group" "api_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 7
    }

  # aws_cloudwatch_log_group.metrics will be created
  + resource "aws_cloudwatch_log_group" "metrics" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cds-covid-alert-create-metric-record"
      + retention_in_days = 14
    }

  # aws_ecs_task_definition.covidshield_key_retrieval must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_retrieval" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/KeyRetrieval:230" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "z8oP0NRnbJ8P1frPGQrd"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeyRetrieval" -> (known after apply)
      ~ revision                 = 230 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.covidshield_key_submission must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_submission" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/KeySubmission:228" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENABLE_TEST_TOOLS"
                          - value = "true"
                        },
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-submission"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeySubmission"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-submission"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeySubmission" -> (known after apply)
      ~ revision                 = 228 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "cds-covid-alert-create-metric-record"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cds-covid-alert-bucket-dev-005133826942/*",
                        ]
                      + Sid      = "VisualEditor0"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_role.api_gatway_cloudwatch_role will be created
  + resource "aws_iam_role" "api_gatway_cloudwatch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cds-covid-alert-create-metric-recordapi_gateway_cloudwatch_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cds-covid-alert-create-metric-record.role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.cloudwatch will be created
  + resource "aws_iam_role_policy" "cloudwatch" {
      + id     = (known after apply)
      + name   = "default"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cds-covid-alert-create-metric-record.role"
    }

  # aws_lambda_function.metrics will be created
  + resource "aws_lambda_function" "metrics" {
      + arn                            = (known after apply)
      + description                    = "Lambda function for collecting metrics records"
      + function_name                  = "cds-covid-alert-create-metric-record"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = "cds-terraform-lambda-zips"
      + s3_key                         = "createRecord.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre"  = "CovidShield"
          + "Deployment"  = "Terraform"
          + "Environment" = "staging"
          + "Name"        = "cds-covid-alert-create-metric-record"
          + "Project"     = "COVID-Alert"
          + "Resource"    = "Lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "dataBucket" = "cds-covid-alert-bucket-dev-005133826942"
              + "fileLoca"   = "metrics"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = [
              + "subnet-034f98e3cdd11a7ef",
              + "subnet-05ffd2f0b629a7731",
              + "subnet-083e2bb4d6a9edf1d",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action        = "lambda:InvokeFunction"
      + function_name = "cds-covid-alert-create-metric-record"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowAPIGatewayInvoke"
    }

  # aws_s3_bucket.raw_metrics_bucket will be created
  + resource "aws_s3_bucket" "raw_metrics_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "cds-covid-alert-bucket-dev-005133826942"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre"  = "CovidShield"
          + "Deployment"  = "Terraform"
          + "Environment" = "staging"
          + "Name"        = "cds-covid-alert-bucket-dev"
          + "Project"     = "COVID-Alert"
          + "Resource"    = "S3"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + logging {
          + target_bucket = "cds-covid-alert-bucket-logging-dev-005133826942"
          + target_prefix = "cds-covid-alert-create-metric-record/logs005133826942"
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.raw_metrics_bucket_logs will be created
  + resource "aws_s3_bucket" "raw_metrics_bucket_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "cds-covid-alert-bucket-logging-dev-005133826942"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre"  = "CovidShield"
          + "Deployment"  = "Terraform"
          + "Environment" = "staging"
          + "Name"        = "cds-covid-alert-bucket-logging-dev"
          + "Project"     = "COVID-Alert"
          + "Resource"    = "S3"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 90
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.raw_metrics_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "raw_metrics_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.raw_metrics_bucket_logs will be created
  + resource "aws_s3_bucket_public_access_block" "raw_metrics_bucket_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_security_group.covidshield_database will be updated in-place
  ~ resource "aws_security_group" "covidshield_database" {
        id                     = "sg-06be84cecd0622042"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-01c8d2505904ab6c7",
                  - "sg-0dccc93503d5844ed",
                ]
              - self             = false
              - to_port          = 3306
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05f8484d0adea8cf0",
                ]
              - self             = false
              - to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-01c8d2505904ab6c7",
                  + "sg-0dccc93503d5844ed",
                ]
              + self             = false
              + to_port          = 3306
            },
        ]
        name                   = "covidshield-database"
        tags                   = {
            "CostCentre" = "CovidShield"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.lambda_sg will be created
  + resource "aws_security_group" "lambda_sg" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "allow_tls"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-06fbc7337b116cce1"
    }

  # aws_wafv2_web_acl.metrics_collection will be created
  + resource "aws_wafv2_web_acl" "metrics_collection" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "WAF for API protection"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "metrics_collection1"
      + scope       = "REGIONAL"
      + tags        = {
          + "CostCentre"  = "CovidShield"
          + "Deployment"  = "Terraform"
          + "Environment" = "staging"
          + "Name"        = "cds-covid-alert-create-metric-record"
          + "Project"     = "COVID-Alert"
          + "Resource"    = "WAF"
        }

      + default_action {

          + block {}
        }

      + rule {
          + name     = "KeyRetrievalRateLimit"
          + priority = 101

          + action {

              + block {}
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 10000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "KeyRetrievalRateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 2

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 3

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 4

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesSQLiRuleSet"
          + priority = 5

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesSQLiRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesSQLiRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "metrics-submission"
          + sampled_requests_enabled   = false
        }
    }

  # aws_wafv2_web_acl_association.waf_association will be created
  + resource "aws_wafv2_web_acl_association" "waf_association" {
      + id           = (known after apply)
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

Plan: 31 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  + base_url = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @tpjods, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*